# Module: Pandas Assignments
## Lesson: Pandas

In [1]:
import pandas as pd
import numpy as np

### Assignment 1: DataFrame Creation and Indexing

1. Create a Pandas DataFrame with 4 columns and 6 rows filled with random integers. Set the index to be the first column.

In [7]:
arr = np.random.randint(1,21,size=(6,4))

df = pd.DataFrame(arr,columns=['A', 'B', 'C', 'D'])
df.set_index('A', inplace=True)
df

     B   C   D
A
3   16   9   7
20  15  19  12
7    1   7  16
20  12   1  15
6   20  10   2
1   14  11  16

2. Create a Pandas DataFrame with columns 'A', 'B', 'C' and index 'X', 'Y', 'Z'. Fill the DataFrame with random integers and access the element at row 'Y' and column 'B'.

In [21]:
df = pd.DataFrame(np.random.randint(1,101,size=(3,3)), columns=['A', 'B', 'C'], index=['X','Y', 'Z'])


print(df.at['Y','B'])

8

### Assignment 2: DataFrame Operations

1. Create a Pandas DataFrame with 3 columns and 5 rows filled with random integers. Add a new column that is the product of the first two columns.

In [25]:
df = pd.DataFrame(np.random.randint(1,101,size=(5,3)), columns=['A','B','C'])
df

df['new_column'] = df['A']*df['B']
df

    A   B   C  new_column
0   4  71  77         284
1  39  39  78        1521
2  25  56  41        1400
3   5  83  80         415
4  43   8  19         344

2. Create a Pandas DataFrame with 3 columns and 4 rows filled with random integers. Compute the row-wise and column-wise sum.

In [30]:
df = pd.DataFrame(np.random.randint(1,101,size=(4,3)))
print(df)

row_wise = df.sum(axis=0)
col_wise = df.sum(axis=1)
print()
print(f"Row Wise: {row_wise}\n")
print(f"Column Wise: {col_wise}")

    0   1   2
0  29  89  31
1  98  90  80
2  31  72  54
3  76  42  82

Row Wise: 0    234
1    293
2    247
dtype: int64

Column Wise: 0    149
1    268
2    157
3    200
dtype: int64

### Assignment 3: Data Cleaning

1. Create a Pandas DataFrame with 3 columns and 5 rows filled with random integers. Introduce some NaN values. Fill the NaN values with the mean of the respective columns.

In [37]:
df = pd.DataFrame(np.random.randint(1,101,size=(5,3)), columns=['A','B','C'])
print(df)

df.iloc[0,0] = np.nan
df.iloc[1,1] = np.nan
df.iloc[0,2] = np.nan
df.iloc[3,2] = np.nan

print(f"\n{df}\n")


df = df.fillna(df.mean())

print(df)

    A   B   C
0  87  12  91
1  89  25   2
2  88  42   9
3  13  78  80
4  61   5  67

      A     B     C
0   NaN  12.0   NaN
1  89.0   NaN   2.0
2  88.0  42.0   9.0
3  13.0  78.0   NaN
4  61.0   5.0  67.0

       A      B     C
0  62.75  12.00  26.0
1  89.00  34.25   2.0
2  88.00  42.00   9.0
3  13.00  78.00  26.0
4  61.00   5.00  67.0

2. Create a Pandas DataFrame with 4 columns and 6 rows filled with random integers. Introduce some NaN values. Drop the rows with any NaN values.

In [41]:
df = pd.DataFrame(np.random.randint(1,101,size=(5,3)), columns=['A','B','C'])
print(df)

df.iloc[0,0] = np.nan
df.iloc[1,1] = np.nan
df.iloc[0,2] = np.nan
df.iloc[3,2] = np.nan

print(f"\n{df}\n")

df = df.dropna()

print(df)

    A   B   C
0  30  56  52
1  69  47  66
2  31  66  81
3  51  35  62
4  18  44  72

      A     B     C
0   NaN  56.0   NaN
1  69.0   NaN  66.0
2  31.0  66.0  81.0
3  51.0  35.0   NaN
4  18.0  44.0  72.0

      A     B     C
2  31.0  66.0  81.0
4  18.0  44.0  72.0

### Assignment 4: Data Aggregation

1. Create a Pandas DataFrame with 2 columns: 'Category' and 'Value'. Fill the 'Category' column with random categories ('A', 'B', 'C') and the 'Value' column with random integers. Group the DataFrame by 'Category' and compute the sum and mean of 'Value' for each category.

In [ ]:
df = pd.DataFrame(columns=['Category', 'Value'])
df

cate = ['A','B','C']


df['Category'] = np.random.choice(cate,21)
df['Value'] = np.random.randint(1,21,size=21)

group_sum_mean = df.groupby('Category')['Value'].agg('sum','mean')
print(group_sum_mean)

Category
A    33
B    83
C    92
Name: Value, dtype: int32

2. Create a Pandas DataFrame with 3 columns: 'Product', 'Category', and 'Sales'. Fill the DataFrame with random data. Group the DataFrame by 'Category' and compute the total sales for each category.

In [55]:
df = pd.DataFrame(columns=['Product','Category', 'Sales'])
df

cate = ['A','B','C']
pro = ['U','V','X','Y','Z']

df['Product'] = np.random.choice(pro,21)
df['Category'] = np.random.choice(cate,21)
df['Sales'] = np.random.randint(100,1000,size=21)
df


total_sales_by_cate = df.groupby('Category')['Sales'].sum()
print(total_sales_by_cate)

Category
A    2456
B    5993
C    2561
Name: Sales, dtype: int32

### Assignment 5: Merging DataFrames

1. Create two Pandas DataFrames with a common column. Merge the DataFrames using the common column.

In [58]:
df1 = pd.DataFrame({'Key': ['A','B','C'], 'Value': [12,34,56]})
df2 = pd.DataFrame({'Key': ['A','F','C'], 'Value': [12,34,56]})


print(df1)
print(f'\n{df2}\n')

df3 = pd.merge(df1,df2,on='Key',how='inner')
df3

  Key  Value
0   A     12
1   B     34
2   C     56

  Key  Value
0   A     12
1   F     34
2   C     56

  Key  Value_x  Value_y
0   A       12       12
1   C       56       56

2. Create two Pandas DataFrames with different columns. Concatenate the DataFrames along the rows and along the columns.

In [61]:
df1 = pd.DataFrame({'Key': ['A','B','C'], 'Value': [12,34,56]})
df2 = pd.DataFrame({'Key': ['A','F','C'], 'Value': [12,34,56]})


print(df1)
print(f'\n{df2}\n')

row_wise = pd.concat([df1,df2],axis=0)
col_wise = pd.concat([df1,df2],axis=1)

print(f'Row Wise: \n {row_wise} \n')
print(f'Col Wise: \n {col_wise}')

  Key  Value
0   A     12
1   B     34
2   C     56

  Key  Value
0   A     12
1   F     34
2   C     56

Row Wise:
   Key  Value
0   A     12
1   B     34
2   C     56
0   A     12
1   F     34
2   C     56

Col Wise:
   Key  Value Key  Value
0   A     12   A     12
1   B     34   F     34
2   C     56   C     56

### Assignment 6: Time Series Analysis

1. Create a Pandas DataFrame with a datetime index and one column filled with random integers. Resample the DataFrame to compute the monthly mean of the values.

2. Create a Pandas DataFrame with a datetime index ranging from '2021-01-01' to '2021-12-31' and one column filled with random integers. Compute the rolling mean with a window of 7 days.

### Assignment 7: MultiIndex DataFrame

1. Create a Pandas DataFrame with a MultiIndex (hierarchical index). Perform some basic indexing and slicing operations on the MultiIndex DataFrame.

2. Create a Pandas DataFrame with MultiIndex consisting of 'Category' and 'SubCategory'. Fill the DataFrame with random data and compute the sum of values for each 'Category' and 'SubCategory'.

### Assignment 8: Pivot Tables

1. Create a Pandas DataFrame with columns 'Date', 'Category', and 'Value'. Create a pivot table to compute the sum of 'Value' for each 'Category' by 'Date'.

In [74]:
date_rng = pd.date_range(start='2022-01-01', end='2022-01-10', freq='D')
df = pd.DataFrame({'Date': np.random.choice(date_rng, size=20), 'Category': np.random.choice(['A', 'B', 'C'], size=20), 'Value': np.random.randint(1, 100, size=20)})
print("Original DataFrame:")
print(df)

pivot_table = df.pivot_table(values='Value', index='Date',columns='Category', aggfunc='sum')

pivot_table

Original DataFrame:
         Date Category  Value
0  2022-01-06        C      2
1  2022-01-09        C     95
2  2022-01-04        C     64
3  2022-01-07        A     10
4  2022-01-01        C      8
5  2022-01-03        C     62
6  2022-01-04        B     27
7  2022-01-01        B     63
8  2022-01-02        C      4
9  2022-01-08        C     51
10 2022-01-04        C     55
11 2022-01-05        B     48
12 2022-01-07        A     89
13 2022-01-08        C     88
14 2022-01-08        B     11
15 2022-01-10        C     40
16 2022-01-03        A     75
17 2022-01-03        C     32
18 2022-01-06        C     38
19 2022-01-06        B     57

Category       A     B      C
Date
2022-01-01   NaN  63.0    8.0
2022-01-02   NaN   NaN    4.0
2022-01-03  75.0   NaN   94.0
2022-01-04   NaN  27.0  119.0
2022-01-05   NaN  48.0    NaN
2022-01-06   NaN  57.0   40.0
2022-01-07  99.0   NaN    NaN
2022-01-08   NaN  11.0  139.0
2022-01-09   NaN   NaN   95.0
2022-01-10   NaN   NaN   40.0

2. Create a Pandas DataFrame with columns 'Year', 'Quarter', and 'Revenue'. Create a pivot table to compute the mean 'Revenue' for each 'Quarter' by 'Year'.

### Assignment 9: Applying Functions

1. Create a Pandas DataFrame with 3 columns and 5 rows filled with random integers. Apply a function that doubles the values of the DataFrame.

In [64]:
df = pd.DataFrame(columns=['Product','Price'])
df 

pro = ['A','B','C']

df['Product'] = np.random.choice(pro,11)
df['Price'] = np.random.randint(5,100,size=11)

print(f'\n{df}\n')

df['New_Price'] = df['Price'].apply(lambda x: x+(x*0.1) )
df

   Product  Price
0        B     18
1        C     12
2        B     39
3        B     44
4        C      7
5        C      6
6        C      8
7        B     87
8        A     92
9        A     46
10       C     92

   Product  Price  New_Price
0        B     18       19.8
1        C     12       13.2
2        B     39       42.9
3        B     44       48.4
4        C      7        7.7
5        C      6        6.6
6        C      8        8.8
7        B     87       95.7
8        A     92      101.2
9        A     46       50.6
10       C     92      101.2

2. Create a Pandas DataFrame with 3 columns and 6 rows filled with random integers. Apply a lambda function to create a new column that is the sum of the existing columns.

In [70]:
df = pd.DataFrame( np.random.randint(1,1000,size=(6,3)), columns=['A','B','C'])

print(f'\n{df}\n')

df['D'] = df.apply(lambda x: x.sum(),axis=1)
df

# Learning: When to apply on row you can do by chnaging axis
#

     A    B    C
0  494  984  611
1  469  579  186
2  593  907  676
3  649  327   74
4  930  436   69
5  937  214  688

     A    B    C     D
0  494  984  611  2089
1  469  579  186  1234
2  593  907  676  2176
3  649  327   74  1050
4  930  436   69  1435
5  937  214  688  1839

### Assignment 10: Working with Text Data

1. Create a Pandas Series with 5 random text strings. Convert all the strings to uppercase.

2. Create a Pandas Series with 5 random text strings. Extract the first three characters of each string.